from scipy.optimize import linprog
import numpy as np

'''
先转化成标准型
min  c
s.t. Ax <= b
     x  >= 0
'''
# 目标函数
c = np.array([0, 0, 0, 0, 1])    # d_x{max}

# 约束条件
A = np.array([[0, 0, -1, 1, -1], # -x3 + x4 - d_x{max} <= 0
              [0, -1, 1, 0, -1], # -x2 + x3 - d_x{max} <= 0
              [-1, 1, 0, 0, -1], # -x1 + x2 - d_x{max} <= 0
              [-1, 0, 0, 0, 0],  # -x1                 <= r - d1
              [1, 0, 0, 0, 0],   #  x1                 <= r + d1
              [0, -1, 0, 0, 0],  # -x2                 <= r - d2
              [0, 1, 0, 0, 0],   #  x2                 <= r + d2
              [0, 0, -1, 0, 0],  # -x3                 <= r - d3
              [0, 0, 1, 0, 0],   #  x3                 <= r + d3
              [0, 0, 0, -1, 0],  # -x4                 <= r - d4
              [0, 0, 0, 1, 0],   #  x4                 <= r + d4
              ])

# 约束条件的值
b = np.array([0, 0, 0, -2, 6, -8, 12, -14, 18, -24, 28])

# Primal
primal_res = linprog(c, A, b, method='simplex')
print('===========================================================================================')
print('Primal:')
print('-------------------------------------------------------------------------------------------')
print(primal_res)

print('===========================================================================================')


# Dual
dual_res = linprog(0 - b.T, A.T, c.T, bounds=((None, 0), (None, 0), (None, 0), (None, 0), (None, 0),                                               (None, 0), (None, 0), (None, 0), (None, 0), (None, 0),                                               (None, 0)), method='simplex')
print('Dual Resulit:')
print('-------------------------------------------------------------------------------------------')
print(dual_res)
